tutorials/turbulentFlameletRhoSimpleFoam/SANDIA_CH4H2N2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application    	    flameletRhoSimpleFoam;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             10000;

deltaT              1;

writeControl        adjustableRunTime;

writeInterval       1000;

purgeWrite          0;

writeFormat         binary;

writePrecision      6;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

// ************************************************************************* //
