tutorials/turbulentFlameletRhoSimpleFoam/SANDIA_CH4H2N2/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

cp -r 0.org 0
blockMesh
turbulentFlameletRhoSimpleFoam > log | echo "Calculating..." 

